content/research/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-03 Sun 20:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Venkatesh Choppella Research</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Venkatesh Choppella Venkatesh Choppella" />
<link rel="stylesheet" type="text/css" href="../style/css/main.css" />
<link href='http://fonts.googleapis.com/css?family=Gloria+Hallelujah' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Venkatesh Choppella Research</h1>

<div id="outline-container-orge22aa80" class="outline-2 menu">
<h2 id="menu"><a id="orge22aa80"></a>Menu</h2>
<div class="outline-text-2" id="text-menu">
<ul class="org-ul">
<li><a href="../index.html">home</a></li>
<li><a href="../research/index.html">research</a></li>
<li><a href="../teaching/index.html">teaching</a></li>
<li><a href="../biography/index.html">biography</a></li>
<li><a href="../contact/index.html">contact</a></li>
<li><a href="../calendar/index.html">calendar</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7815fd5" class="outline-2 sub-menu">
<h2 id="sub-menu-research"><a id="org7815fd5"></a>Submenu</h2>
<div class="outline-text-2" id="text-sub-menu-research">
<ul class="org-ul">
<li><a href="#areas">research areas</a></li>
<li><a href="#students">students</a></li>
<li><a href="#projects">funded projects</a></li>
</ul>

<ul class="org-ul">
<li><a href="#biblio">bibliography</a></li>
</ul>
</div>
</div>

<div id="outline-container-org39e415e" class="outline-2 main">
<h2 id="main"><a id="org39e415e"></a>Main</h2>
<div class="outline-text-2" id="text-main">
</div>
</div>

<div id="outline-container-org9c58700" class="outline-2 areas">
<h2 id="areas"><a id="org9c58700"></a>Areas of research</h2>
<div class="outline-text-2" id="text-areas">
<dl class="org-dl">
<dt>Software Engineering and Formal Methods</dt><dd>Concurrency
control \cite{2018-arxiv-choppella-et-al,2018-afmss-sanjeev-et-al}, Distributed
Model Checking\cite{Singla-et-al-2016}, Real Time
Systems\cite{Adimoolam-Choppella-2013}, Software and Systems
Engineering\cite{2019-isec-chaudhuri-et-al, 2018-isec-banerjee-et-al,2018-incose-natarajan-et-al},
Human Computer
Interaction\cite{zade-choppella-ihci-2012,zade-et-al-chi-2014},
Workflows
\cite{dinesh-choppella-iceg-2010,Choppella-icdcit-2011,goel-choppella-t4e-2012,Goel-Choppella-icegov-2013},
Modeling of Web Services\cite{WSCL-2002}, Data
Modeling\cite{choppella-sengupta-robertson-johnson-tr-2006,choppella-et-al-afm07}
and Visual
modeling\cite{Choppella-Pulijala-ModSym-2015} and
Software
Architectures\cite{brahmajosyula-choppella-wambse-2011,brahmajosyula-choppella-journal-2011}. Formal
Methods for
VLSI\cite{Rath-Choppella-Johnson-1995,Bose-Tuna-Choppella-FMCAD-1996}</dd>

<dt>Web Accessibility </dt><dd>Renarration and Semantic
Web\cite{Aggarwal-2012,Dinesh-2012-AFR-2207016-2207030,Dinesh-2012-ATR-2207016-2207038,Gollapudi-Choppella-t4e-2013,Prasad-2014-ONA-2596695-2596711,Prasad-et-al-isec-2017,2017-iske-gollapudi-et-al},
\cite{DBLP-conf-seke-SanagavarapuGCR17,2018-icdcit-Prasad-et-al,2018-isec-prasad-et-al},</dd>

<dt>Web Security</dt><dd>Browser-based security policies\cite{Alloy-Corp-Tech-2013,Telikicherla-Choppella-Bezawada-ICISS-2014,Telikicherla-2014-EDS-2593761-2593764,agrawall-et-al-isec-2017,telikicherla-et-al-icissp-2017,2017-ICISS-Agrawall-et-al}</dd>

<dt>Applications of ICT</dt><dd>E-Governance\cite{choppella-srivathsan-icegov-2009}.</dd>

<dt>Educational Technology and Computing Pedagogy</dt><dd>Virtual
Labs\cite{2018-icalt-kumar-et-al, 2018-icalt-swain-et-al, bandi-et-al-t4e-2011,khot-choppella-t4e-2011,choppella-et-al-t4e-2011},\cite{malini-et-al-t4e-2012,Chatterjee-et-al-t4e-2013,2014-t4e-choudhary-et-al,2014-t4e-agarwal-et-al,Kelkar-et-al-icalt-2015,Ahuja-et-al-icalt-2015},
Authoring tools and
environments\cite{naidu-et-al-t4e-2010,Choppella-t4e-tutorial-2010,khare-et-al-t4e-2012},
Ontologies\cite{mavalankar-et-al-t4e-2015}.  Functional
Programming\cite{choppella-et-al-t4e-2012,Choppella-et-al-2016},
Algorithms and Discrete Dynamical
Systems\cite{Manjula-et-al-t4e-2013}.</dd>
</dl>


<dl class="org-dl">
<dt>Compilers and Programming Languages</dt><dd>Evaluation of RMI
protocols\cite{Govindaraju-et-al-Supercomputing-2000},
Algorithm Synthesis from Domain Specific
Languages\cite{Krishnan-et-al-HiPC-2003,Bibireata-et-al-LCPC-2004,Krishnan-et-al-IPDPS-2004,Baumgartner-ieee-2005,Auer-MolPhysics-2006,Hartono-et-al-iccs-2006,krishnan-et-al-jpdc-2006}.
Aspect-Oriented Programming\cite{1999-aop-patent}.
Term Unification\cite{Choppella-Haynes-CADE-2003,Choppella-Haynes-IC-2005},
Type Inference\cite{Choppella-Haynes-1995,Choppella-thesis-02,Choppella-IFL-2003}.</dd>
</dl>
</div>
</div>

<div id="outline-container-orgefae271" class="outline-2 students">
<h2 id="students"><a id="orgefae271"></a>Students</h2>
<div class="outline-text-2" id="text-students">
</div>
<div id="outline-container-org3b68f0a" class="outline-3">
<h3 id="org3b68f0a">Current students</h3>
<div class="outline-text-3" id="text-org3b68f0a">
<dl class="org-dl">
<dt>Amar Banerjee (PhD) </dt><dd>Capability composition for
robotics and cyber-physical systems engineering.</dd>

<dt>Mrityunjay Kumar (PhD)</dt><dd>Model Based design and
implementation of Virtual Lab Experiments</dd>

<dt>Sai Gollapudi (PhD)</dt><dd>Semantic Style Sheets and Renarration</dd>

<dt>Soumya Maddala (MS by research)</dt><dd>Ontology services for
web accessibility</dd>

<dt>Adhish Singla (MS Dual Degree)</dt><dd>Distributed Model Checking.  Supported by Hitachi India.
(Co-advisor with Prof. Suresh Purini)</dd>

<dt>Arjun Sanjeev (BTech/Dual Degree)</dt><dd>Modular Control of
concurrent processes.  Co-advisor: Prof. K Viswanath.</dd>

<dt>Krutam  Hathi (BTech/Dual Degree)</dt><dd>Pedagogy-based
Analytics for virtual labs</dd>
</dl>
</div>
</div>

<div id="outline-container-org1cd3d9b" class="outline-3">
<h3 id="org1cd3d9b">Past research students</h3>
<div class="outline-text-3" id="text-org1cd3d9b">
<dl class="org-dl">
<dt>Akaash Agarwall (MS by research, Apr 2018)</dt><dd><ul class="org-ul">
<li>Thesis title: Application,  Modelling and
Implementation of CORP</li>
<li>Current affiliation: Facebook, California</li>
</ul></dd>
</dl>


<dl class="org-dl">
<dt>Krishna Chaitanya (MS by research, May 2016)</dt><dd><ul class="org-ul">
<li>Thesis title:  <a href="http://web2py.iiit.ac.in/research_centres/publications/view_publication/mastersthesis/407">Mitigating Web-borne Security Threats by Enhancing Browser Security Policies</a></li>
<li>Current affiliation:  Microsoft Hyderabad</li>
</ul></dd>
</dl>


<dl class="org-dl">
<dt>Ankur Goel (MS by research, Apr 2016)</dt><dd><ul class="org-ul">
<li>Thesis title: <a href="http://web2py.iiit.ac.in/research_centres/publications/view_publication/mastersthesis/412">Specification and Modelling of Workflow Management Systems with State Based Access Control</a></li>
<li>Current Affiliation: Startup in Hyderabad</li>
</ul></dd>
</dl>


<dl class="org-dl">
<dt>Himanshu Zade (MS by research, Apr 2015)</dt><dd><ul class="org-ul">
<li>Thesis title:  <a href="http://web2py.iiit.ac.in/research_centres/publications/view_publication/mastersthesis/336">Evolution of Mental Models of Interactive Machines: A Formal Approach</a></li>
<li>Current affiliation: Univ of Washington PhD programme</li>
</ul></dd>
</dl>


<dl class="org-dl">
<dt>Santosh Aravind Adimoolam (MS by research Apr 2014)</dt><dd><ul class="org-ul">
<li>Thesis title:
<a href="http://web2py.iiit.ac.in/research_centres/publications/view_publication/mastersthesis/300">Automata based abstraction of interval assumptions and bounded input linear systems for verification and controller synthesis</a></li>
<li>Co-advisor:  Prof. K Viswanath</li>
<li>Financial Support:  Siemens R&amp;D India.</li>
<li>Current affiliation: VERIMAG, France.</li>
</ul></dd>
</dl>


<dl class="org-dl">
<dt>Deepti Aggarwal (MS by research, Nov 2013)</dt><dd><ul class="org-ul">
<li>Thesis title: <a href="http://web2py.iiit.ac.in/research_centres/publications/view_publication/mastersthesis/232">Exploring Crowdsourcing to PersonalizeWeb Experiences</a></li>
<li>Co-advisor:  Prof. Vasudeva Varma</li>
<li>Current affiliation: Univ of Melbourne</li>
</ul></dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org6fb491c" class="outline-2 projects">
<h2 id="projects"><a id="org6fb491c"></a>Funded Projects</h2>
<div class="outline-text-2" id="text-projects">
<dl class="org-dl">
<dt>1. Virtual Labs, Phase II and III (co-PI)</dt><dd>2016-2020. Sponsor: MHRD, Govt. of India.  Consortium
partners: IITs at Bombay Delhi, Guwahati Kanpur,
Kharagpur, Roorkee, Amrita University, COE Pune,
Dayalbagh University, NIT Surathkal.  Total Budget:
Rs. 100 Crores for 5 years.</dd>

<dt>(no term)</dt><dd>2. State variable approach to the model-driven
development of software for reactive systems (PI) ::
2011-2013.  Sponsor: Siemens India, Bangalore.  Budget:
Rs. 14 Lakhs.</dd>
</dl>



<dl class="org-dl">
<dt>3. Distributed Model Checking</dt><dd>(Co-PI) 2014-2016.
Sponsor: Hitachi India Limited.  Budget: 15 Lakhs.</dd>
</dl>


<dl class="org-dl">
<dt>4. Virtual Labs Phase I</dt><dd>2010-2014. Sponsor: Virtual
Labs consortium under the Virtual Labs main phase
project.  Budget: 3.3 Cr.</dd>

<dt>(no term)</dt><dd>5. European Commission Erasmus Mundus External
Cooperation Window (co-PI) :: European Research and
Educational Collaboration with Asia Project for Academic
Mobility 2008-2009. <a href="http://www.mrtc.mdh.se/eureca/">http://www.mrtc.mdh.se/eureca/</a>.
Institute Coordinator for IIITMK.  Budget: 10,000 Euro.</dd>

<dt>6. ISEA (PI)</dt><dd>Ministry of Information Technology,
Government of India.  Information
Security Education and Awareness (ISEA)
2006-2009.  Principal Investigator at
Participating Institution IIITM-K.
Rs. 3L per annum.</dd>

<dt>7. Government of Kerala (co-PI)</dt><dd>Police Portal for
Community Interaction 2004-2005.  Budget Rs. 2.9L
Co-investigator.</dd>
</dl>
</div>
</div>

<div id="outline-container-orgeae8e02" class="outline-2 biblio">
<h2 id="biblio"><a id="orgeae8e02"></a>Bibliography</h2>
<div class="outline-text-2" id="text-biblio">
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Venkatesh Choppella Venkatesh Choppella</p>
<p class="date">Created: 2023-12-03 Sun 20:01</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
